{
  "id2phone": [
    "<blank>",
    "<unk>",
    "a-0",
    "a-1",
    "a-2",
    "a-3",
    "a-4",
    "a-5",
    "aː-0",
    "aː-1",
    "aː-2",
    "aː-3",
    "aː-4",
    "aː-5",
    "e-0",
    "e-1",
    "e-2",
    "e-3",
    "e-4",
    "e-5",
    "eaː-0",
    "eaː-1",
    "eaː-2",
    "eaː-3",
    "eaː-4",
    "eaː-5",
    "f",
    "h",
    "i-0",
    "i-1",
    "i-2",
    "i-3",
    "i-4",
    "i-5",
    "iz",
    "iə-0",
    "iə-1",
    "iə-2",
    "iə-3",
    "iə-4",
    "iə-5",
    "k",
    "kpz",
    "kz",
    "k̟z",
    "l",
    "m",
    "mz",
    "n",
    "nz",
    "o-0",
    "o-1",
    "o-2",
    "o-3",
    "o-4",
    "o-5",
    "p",
    "pz",
    "s",
    "t",
    "tz",
    "tʰ",
    "t͡ɕ",
    "u-0",
    "u-1",
    "u-2",
    "u-3",
    "u-4",
    "u-5",
    "uz",
    "uə-0",
    "uə-1",
    "uə-3",
    "uə-4",
    "uə-5",
    "v",
    "w",
    "x",
    "z",
    "ŋ",
    "ŋmz",
    "ŋz",
    "ŋ̟z",
    "ɓ",
    "ɔ-0",
    "ɔ-1",
    "ɔ-2",
    "ɔ-3",
    "ɔ-4",
    "ɔ-5",
    "ɗ",
    "ə-0",
    "ə-1",
    "ə-2",
    "ə-3",
    "ə-4",
    "ə-5",
    "əː-0",
    "əː-1",
    "əː-2",
    "əː-3",
    "əː-4",
    "əː-5",
    "ɛ-0",
    "ɛ-1",
    "ɛ-2",
    "ɛ-3",
    "ɛ-4",
    "ɛ-5",
    "ɣ",
    "ɨ-0",
    "ɨ-1",
    "ɨ-2",
    "ɨ-3",
    "ɨ-4",
    "ɨ-5",
    "ɨə-0",
    "ɨə-1",
    "ɨə-2",
    "ɨə-3",
    "ɨə-4",
    "ɨə-5",
    "ɲ"
  ],
  "phone2id": {
    "<blank>": 0,
    "<unk>": 1,
    "a-0": 2,
    "a-1": 3,
    "a-2": 4,
    "a-3": 5,
    "a-4": 6,
    "a-5": 7,
    "aː-0": 8,
    "aː-1": 9,
    "aː-2": 10,
    "aː-3": 11,
    "aː-4": 12,
    "aː-5": 13,
    "e-0": 14,
    "e-1": 15,
    "e-2": 16,
    "e-3": 17,
    "e-4": 18,
    "e-5": 19,
    "eaː-0": 20,
    "eaː-1": 21,
    "eaː-2": 22,
    "eaː-3": 23,
    "eaː-4": 24,
    "eaː-5": 25,
    "f": 26,
    "h": 27,
    "i-0": 28,
    "i-1": 29,
    "i-2": 30,
    "i-3": 31,
    "i-4": 32,
    "i-5": 33,
    "iz": 34,
    "iə-0": 35,
    "iə-1": 36,
    "iə-2": 37,
    "iə-3": 38,
    "iə-4": 39,
    "iə-5": 40,
    "k": 41,
    "kpz": 42,
    "kz": 43,
    "k̟z": 44,
    "l": 45,
    "m": 46,
    "mz": 47,
    "n": 48,
    "nz": 49,
    "o-0": 50,
    "o-1": 51,
    "o-2": 52,
    "o-3": 53,
    "o-4": 54,
    "o-5": 55,
    "p": 56,
    "pz": 57,
    "s": 58,
    "t": 59,
    "tz": 60,
    "tʰ": 61,
    "t͡ɕ": 62,
    "u-0": 63,
    "u-1": 64,
    "u-2": 65,
    "u-3": 66,
    "u-4": 67,
    "u-5": 68,
    "uz": 69,
    "uə-0": 70,
    "uə-1": 71,
    "uə-3": 72,
    "uə-4": 73,
    "uə-5": 74,
    "v": 75,
    "w": 76,
    "x": 77,
    "z": 78,
    "ŋ": 79,
    "ŋmz": 80,
    "ŋz": 81,
    "ŋ̟z": 82,
    "ɓ": 83,
    "ɔ-0": 84,
    "ɔ-1": 85,
    "ɔ-2": 86,
    "ɔ-3": 87,
    "ɔ-4": 88,
    "ɔ-5": 89,
    "ɗ": 90,
    "ə-0": 91,
    "ə-1": 92,
    "ə-2": 93,
    "ə-3": 94,
    "ə-4": 95,
    "ə-5": 96,
    "əː-0": 97,
    "əː-1": 98,
    "əː-2": 99,
    "əː-3": 100,
    "əː-4": 101,
    "əː-5": 102,
    "ɛ-0": 103,
    "ɛ-1": 104,
    "ɛ-2": 105,
    "ɛ-3": 106,
    "ɛ-4": 107,
    "ɛ-5": 108,
    "ɣ": 109,
    "ɨ-0": 110,
    "ɨ-1": 111,
    "ɨ-2": 112,
    "ɨ-3": 113,
    "ɨ-4": 114,
    "ɨ-5": 115,
    "ɨə-0": 116,
    "ɨə-1": 117,
    "ɨə-2": 118,
    "ɨə-3": 119,
    "ɨə-4": 120,
    "ɨə-5": 121,
    "ɲ": 122
  }
}